garyPenhook/PIC-Assembler/device_includes/pic16f17176.inc
// Register: PWM3LDS
#define PWM3LDS PWM3LDS
PWM3LDS                                  equ 098Eh
// bitfield definitions
PWM3LDS_LDS_POSN                         equ 0000h
PWM3LDS_LDS_POSITION                     equ 0000h
PWM3LDS_LDS_SIZE                         equ 0008h
PWM3LDS_LDS_LENGTH                       equ 0008h
PWM3LDS_LDS_MASK                         equ 00FFh
PWM3LDS_LDS0_POSN                        equ 0000h
PWM3LDS_LDS0_POSITION                    equ 0000h
PWM3LDS_LDS0_SIZE                        equ 0001h
PWM3LDS_LDS0_LENGTH                      equ 0001h
PWM3LDS_LDS0_MASK                        equ 0001h
PWM3LDS_LDS1_POSN                        equ 0001h
PWM3LDS_LDS1_POSITION                    equ 0001h
PWM3LDS_LDS1_SIZE                        equ 0001h
PWM3LDS_LDS1_LENGTH                      equ 0001h
PWM3LDS_LDS1_MASK                        equ 0002h
PWM3LDS_LDS2_POSN                        equ 0002h
PWM3LDS_LDS2_POSITION                    equ 0002h
PWM3LDS_LDS2_SIZE                        equ 0001h
PWM3LDS_LDS2_LENGTH                      equ 0001h
PWM3LDS_LDS2_MASK                        equ 0004h

// Register: PWM3PRL
#define PWM3PRL PWM3PRL
PWM3PRL                                  equ 098Fh
// bitfield definitions
PWM3PRL_PRL_POSN                         equ 0000h
PWM3PRL_PRL_POSITION                     equ 0000h
PWM3PRL_PRL_SIZE                         equ 0008h
PWM3PRL_PRL_LENGTH                       equ 0008h
PWM3PRL_PRL_MASK                         equ 00FFh

// Register: PWM3PRH
#define PWM3PRH PWM3PRH
PWM3PRH                                  equ 0990h
// bitfield definitions
PWM3PRH_PRH_POSN                         equ 0000h
PWM3PRH_PRH_POSITION                     equ 0000h
PWM3PRH_PRH_SIZE                         equ 0008h
PWM3PRH_PRH_LENGTH                       equ 0008h
PWM3PRH_PRH_MASK                         equ 00FFh

// Register: PWM3CPRE
#define PWM3CPRE PWM3CPRE
PWM3CPRE                                 equ 0991h
// bitfield definitions
PWM3CPRE_CPRE_POSN                       equ 0000h
PWM3CPRE_CPRE_POSITION                   equ 0000h
PWM3CPRE_CPRE_SIZE                       equ 0008h
PWM3CPRE_CPRE_LENGTH                     equ 0008h
PWM3CPRE_CPRE_MASK                       equ 00FFh

// Register: PWM3PIPOS
#define PWM3PIPOS PWM3PIPOS
PWM3PIPOS                                equ 0992h
// bitfield definitions
PWM3PIPOS_PIPOS_POSN                     equ 0000h
PWM3PIPOS_PIPOS_POSITION                 equ 0000h
PWM3PIPOS_PIPOS_SIZE                     equ 0008h
PWM3PIPOS_PIPOS_LENGTH                   equ 0008h
PWM3PIPOS_PIPOS_MASK                     equ 00FFh

// Register: PWM3GIR
#define PWM3GIR PWM3GIR
PWM3GIR                                  equ 0993h
// bitfield definitions
PWM3GIR_S1P1_POSN                        equ 0000h
PWM3GIR_S1P1_POSITION                    equ 0000h
PWM3GIR_S1P1_SIZE                        equ 0001h
PWM3GIR_S1P1_LENGTH                      equ 0001h
PWM3GIR_S1P1_MASK                        equ 0001h
PWM3GIR_S1P2_POSN                        equ 0001h
PWM3GIR_S1P2_POSITION                    equ 0001h
PWM3GIR_S1P2_SIZE                        equ 0001h
PWM3GIR_S1P2_LENGTH                      equ 0001h
PWM3GIR_S1P2_MASK                        equ 0002h
PWM3GIR_S1P1IF_POSN                      equ 0000h
PWM3GIR_S1P1IF_POSITION                  equ 0000h
PWM3GIR_S1P1IF_SIZE                      equ 0001h
PWM3GIR_S1P1IF_LENGTH                    equ 0001h
PWM3GIR_S1P1IF_MASK                      equ 0001h
PWM3GIR_S1P2IF_POSN                      equ 0001h
PWM3GIR_S1P2IF_POSITION                  equ 0001h
PWM3GIR_S1P2IF_SIZE                      equ 0001h
PWM3GIR_S1P2IF_LENGTH                    equ 0001h
PWM3GIR_S1P2IF_MASK                      equ 0002h

// Register: PWM3GIE
#define PWM3GIE PWM3GIE
PWM3GIE                                  equ 0994h
// bitfield definitions
PWM3GIE_S1P1_POSN                        equ 0000h
PWM3GIE_S1P1_POSITION                    equ 0000h
PWM3GIE_S1P1_SIZE                        equ 0001h
PWM3GIE_S1P1_LENGTH                      equ 0001h
PWM3GIE_S1P1_MASK                        equ 0001h
PWM3GIE_S1P2_POSN                        equ 0001h
PWM3GIE_S1P2_POSITION                    equ 0001h
PWM3GIE_S1P2_SIZE                        equ 0001h
PWM3GIE_S1P2_LENGTH                      equ 0001h
PWM3GIE_S1P2_MASK                        equ 0002h
PWM3GIE_S1P1IE_POSN                      equ 0000h
PWM3GIE_S1P1IE_POSITION                  equ 0000h
PWM3GIE_S1P1IE_SIZE                      equ 0001h
PWM3GIE_S1P1IE_LENGTH                    equ 0001h
PWM3GIE_S1P1IE_MASK                      equ 0001h
PWM3GIE_S1P2IE_POSN                      equ 0001h
PWM3GIE_S1P2IE_POSITION                  equ 0001h
PWM3GIE_S1P2IE_SIZE                      equ 0001h
PWM3GIE_S1P2IE_LENGTH                    equ 0001h
PWM3GIE_S1P2IE_MASK                      equ 0002h

// Register: PWM3CON
#define PWM3CON PWM3CON
PWM3CON                                  equ 0995h
// bitfield definitions
PWM3CON_ERSNOW_POSN                      equ 0000h
PWM3CON_ERSNOW_POSITION                  equ 0000h
PWM3CON_ERSNOW_SIZE                      equ 0001h
PWM3CON_ERSNOW_LENGTH                    equ 0001h
PWM3CON_ERSNOW_MASK                      equ 0001h
PWM3CON_ERSPOL_POSN                      equ 0001h
PWM3CON_ERSPOL_POSITION                  equ 0001h
PWM3CON_ERSPOL_SIZE                      equ 0001h
PWM3CON_ERSPOL_LENGTH                    equ 0001h
PWM3CON_ERSPOL_MASK                      equ 0002h
PWM3CON_LD_POSN                          equ 0002h
PWM3CON_LD_POSITION                      equ 0002h
PWM3CON_LD_SIZE                          equ 0001h
PWM3CON_LD_LENGTH                        equ 0001h
PWM3CON_LD_MASK                          equ 0004h
PWM3CON_EN_POSN                          equ 0007h
PWM3CON_EN_POSITION                      equ 0007h
PWM3CON_EN_SIZE                          equ 0001h
PWM3CON_EN_LENGTH                        equ 0001h
PWM3CON_EN_MASK                          equ 0080h

// Register: PWM3S1CFG
#define PWM3S1CFG PWM3S1CFG
PWM3S1CFG                                equ 0996h
// bitfield definitions
PWM3S1CFG_MODE_POSN                      equ 0000h
PWM3S1CFG_MODE_POSITION                  equ 0000h
PWM3S1CFG_MODE_SIZE                      equ 0003h
PWM3S1CFG_MODE_LENGTH                    equ 0003h
PWM3S1CFG_MODE_MASK                      equ 0007h
PWM3S1CFG_PPEN_POSN                      equ 0003h
PWM3S1CFG_PPEN_POSITION                  equ 0003h
PWM3S1CFG_PPEN_SIZE                      equ 0001h
PWM3S1CFG_PPEN_LENGTH                    equ 0001h
PWM3S1CFG_PPEN_MASK                      equ 0008h
PWM3S1CFG_POL1_POSN                      equ 0006h
PWM3S1CFG_POL1_POSITION                  equ 0006h
PWM3S1CFG_POL1_SIZE                      equ 0001h
PWM3S1CFG_POL1_LENGTH                    equ 0001h
PWM3S1CFG_POL1_MASK                      equ 0040h
PWM3S1CFG_POL2_POSN                      equ 0007h
PWM3S1CFG_POL2_POSITION                  equ 0007h
PWM3S1CFG_POL2_SIZE                      equ 0001h
PWM3S1CFG_POL2_LENGTH                    equ 0001h
PWM3S1CFG_POL2_MASK                      equ 0080h
PWM3S1CFG_MODE0_POSN                     equ 0000h
PWM3S1CFG_MODE0_POSITION                 equ 0000h
PWM3S1CFG_MODE0_SIZE                     equ 0001h
PWM3S1CFG_MODE0_LENGTH                   equ 0001h
PWM3S1CFG_MODE0_MASK                     equ 0001h
PWM3S1CFG_MODE1_POSN                     equ 0001h
PWM3S1CFG_MODE1_POSITION                 equ 0001h
PWM3S1CFG_MODE1_SIZE                     equ 0001h
PWM3S1CFG_MODE1_LENGTH                   equ 0001h
PWM3S1CFG_MODE1_MASK                     equ 0002h
PWM3S1CFG_MODE2_POSN                     equ 0002h
PWM3S1CFG_MODE2_POSITION                 equ 0002h
PWM3S1CFG_MODE2_SIZE                     equ 0001h
PWM3S1CFG_MODE2_LENGTH                   equ 0001h
PWM3S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM3S1P1L
#define PWM3S1P1L PWM3S1P1L
PWM3S1P1L                                equ 0997h
// bitfield definitions
PWM3S1P1L_P1L_POSN                       equ 0000h
PWM3S1P1L_P1L_POSITION                   equ 0000h
PWM3S1P1L_P1L_SIZE                       equ 0008h
PWM3S1P1L_P1L_LENGTH                     equ 0008h
PWM3S1P1L_P1L_MASK                       equ 00FFh
PWM3S1P1L_S1P1L_POSN                     equ 0000h
PWM3S1P1L_S1P1L_POSITION                 equ 0000h
PWM3S1P1L_S1P1L_SIZE                     equ 0008h
PWM3S1P1L_S1P1L_LENGTH                   equ 0008h
PWM3S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM3S1P1H
#define PWM3S1P1H PWM3S1P1H
PWM3S1P1H                                equ 0998h
// bitfield definitions
PWM3S1P1H_P1H_POSN                       equ 0000h
PWM3S1P1H_P1H_POSITION                   equ 0000h
PWM3S1P1H_P1H_SIZE                       equ 0008h
PWM3S1P1H_P1H_LENGTH                     equ 0008h
PWM3S1P1H_P1H_MASK                       equ 00FFh
PWM3S1P1H_S1P1H_POSN                     equ 0000h
PWM3S1P1H_S1P1H_POSITION                 equ 0000h
PWM3S1P1H_S1P1H_SIZE                     equ 0008h
PWM3S1P1H_S1P1H_LENGTH                   equ 0008h
PWM3S1P1H_S1P1H_MASK                     equ 00FFh

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
PWM3S1P2L                                equ 0999h
// bitfield definitions
PWM3S1P2L_P2L_POSN                       equ 0000h
PWM3S1P2L_P2L_POSITION                   equ 0000h
PWM3S1P2L_P2L_SIZE                       equ 0008h
PWM3S1P2L_P2L_LENGTH                     equ 0008h
PWM3S1P2L_P2L_MASK                       equ 00FFh
PWM3S1P2L_S1P2L_POSN                     equ 0000h
PWM3S1P2L_S1P2L_POSITION                 equ 0000h
PWM3S1P2L_S1P2L_SIZE                     equ 0008h
PWM3S1P2L_S1P2L_LENGTH                   equ 0008h
PWM3S1P2L_S1P2L_MASK                     equ 00FFh

