garyPenhook/PIC-Assembler/device_includes/pic16f17176.inc
#define READ_WRITE1                      BANKMASK(SSP1STAT), 2
#define READ_WRITE2                      BANKMASK(SSP2STAT), 2
#define REFRNG                           BANKMASK(DAC1CON), 6
#define REN                              BANKMASK(CWG1AS0), 6
#define RES0                             BANKMASK(ADRESL), 0
#define RES1                             BANKMASK(ADRESL), 1
#define RES10                            BANKMASK(ADRESH), 2
#define RES11                            BANKMASK(ADRESH), 3
#define RES12                            BANKMASK(ADRESH), 4
#define RES13                            BANKMASK(ADRESH), 5
#define RES14                            BANKMASK(ADRESH), 6
#define RES15                            BANKMASK(ADRESH), 7
#define RES2                             BANKMASK(ADRESL), 2
#define RES3                             BANKMASK(ADRESL), 3
#define RES4                             BANKMASK(ADRESL), 4
#define RES5                             BANKMASK(ADRESL), 5
#define RES6                             BANKMASK(ADRESL), 6
#define RES7                             BANKMASK(ADRESL), 7
#define RES8                             BANKMASK(ADRESH), 0
#define RES9                             BANKMASK(ADRESH), 1
#define RESON                            BANKMASK(OPA1CON1), 3
#define ROI                              BANKMASK(CPUDOZE), 5
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RSEN2                            BANKMASK(SSP2CON2), 1
#define RW1                              BANKMASK(SSP1STAT), 2
#define RW2                              BANKMASK(SSP2STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_W2                             BANKMASK(SSP2STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define R_nW2                            BANKMASK(SSP2STAT), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCANIE                           BANKMASK(PIE1), 2
#define SCANIF                           BANKMASK(PIR1), 2
#define SCANMD                           BANKMASK(PMD0), 2
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SEN2                             BANKMASK(SSP2CON2), 0
#define SETUP0                           BANKMASK(CRCCON0), 2
#define SETUP1                           BANKMASK(CRCCON0), 3
#define SFOR                             BANKMASK(OSCSTAT), 1
#define SGO                              BANKMASK(SCANCON0), 6
#define SHIFT0                           BANKMASK(CRCSHFTL), 0
#define SHIFT1                           BANKMASK(CRCSHFTL), 1
#define SHIFT10                          BANKMASK(CRCSHFTH), 2
#define SHIFT11                          BANKMASK(CRCSHFTH), 3
#define SHIFT12                          BANKMASK(CRCSHFTH), 4
#define SHIFT13                          BANKMASK(CRCSHFTH), 5
#define SHIFT14                          BANKMASK(CRCSHFTH), 6
#define SHIFT15                          BANKMASK(CRCSHFTH), 7
#define SHIFT16                          BANKMASK(CRCSHFTU), 0
#define SHIFT17                          BANKMASK(CRCSHFTU), 1
#define SHIFT18                          BANKMASK(CRCSHFTU), 2
#define SHIFT19                          BANKMASK(CRCSHFTU), 3
#define SHIFT2                           BANKMASK(CRCSHFTL), 2
#define SHIFT20                          BANKMASK(CRCSHFTU), 4
#define SHIFT21                          BANKMASK(CRCSHFTU), 5
#define SHIFT22                          BANKMASK(CRCSHFTU), 6
#define SHIFT23                          BANKMASK(CRCSHFTU), 7
#define SHIFT24                          BANKMASK(CRCSHFTT), 0
#define SHIFT25                          BANKMASK(CRCSHFTT), 1
#define SHIFT26                          BANKMASK(CRCSHFTT), 2
#define SHIFT27                          BANKMASK(CRCSHFTT), 3
#define SHIFT28                          BANKMASK(CRCSHFTT), 4
#define SHIFT29                          BANKMASK(CRCSHFTT), 5
#define SHIFT3                           BANKMASK(CRCSHFTL), 3
#define SHIFT30                          BANKMASK(CRCSHFTT), 6
#define SHIFT31                          BANKMASK(CRCSHFTT), 7
#define SHIFT4                           BANKMASK(CRCSHFTL), 4
#define SHIFT5                           BANKMASK(CRCSHFTL), 5
#define SHIFT6                           BANKMASK(CRCSHFTL), 6
#define SHIFT7                           BANKMASK(CRCSHFTL), 7
#define SHIFT8                           BANKMASK(CRCSHFTH), 0
#define SHIFT9                           BANKMASK(CRCSHFTH), 1
#define SHIFTM                           BANKMASK(CRCCON0), 1
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7
#define SLCT0                            BANKMASK(CLCSELECT), 0
#define SLCT1                            BANKMASK(CLCSELECT), 1
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA3                            BANKMASK(SLRCONA), 3
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRA6                            BANKMASK(SLRCONA), 6
#define SLRA7                            BANKMASK(SLRCONA), 7
#define SLRB0                            BANKMASK(SLRCONB), 0
#define SLRB1                            BANKMASK(SLRCONB), 1
#define SLRB2                            BANKMASK(SLRCONB), 2
#define SLRB3                            BANKMASK(SLRCONB), 3
#define SLRB4                            BANKMASK(SLRCONB), 4
#define SLRB5                            BANKMASK(SLRCONB), 5
#define SLRB6                            BANKMASK(SLRCONB), 6
#define SLRB7                            BANKMASK(SLRCONB), 7
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SLRC6                            BANKMASK(SLRCONC), 6
#define SLRC7                            BANKMASK(SLRCONC), 7
#define SLRD0                            BANKMASK(SLRCOND), 0
#define SLRD1                            BANKMASK(SLRCOND), 1
#define SLRD2                            BANKMASK(SLRCOND), 2
#define SLRD3                            BANKMASK(SLRCOND), 3
#define SLRD4                            BANKMASK(SLRCOND), 4
#define SLRD5                            BANKMASK(SLRCOND), 5
#define SLRD6                            BANKMASK(SLRCOND), 6
#define SLRD7                            BANKMASK(SLRCOND), 7
#define SLRE0                            BANKMASK(SLRCONE), 0
#define SLRE1                            BANKMASK(SLRCONE), 1
#define SLRE2                            BANKMASK(SLRCONE), 2
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SMP2                             BANKMASK(SSP2STAT), 7
#define SOC0                             BANKMASK(OPA1CON0), 0
#define SOC1                             BANKMASK(OPA1CON0), 1
#define SOI                              BANKMASK(ADCON3), 3
#define SOR                              BANKMASK(OSCSTAT), 3
#define SOSCEN                           BANKMASK(OSCEN), 3
#define SOSCPWR                          BANKMASK(OSCCON3), 6
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1CLKPPS5                      BANKMASK(SSP1CLKPPS), 5
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1DATPPS5                      BANKMASK(SSP1DATPPS), 5
#define SSP1IE                           BANKMASK(PIE5), 2
#define SSP1IF                           BANKMASK(PIR5), 2
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSP1SSPPS5                       BANKMASK(SSP1SSPPS), 5
#define SSP2IE                           BANKMASK(PIE5), 4
#define SSP2IF                           BANKMASK(PIR5), 4
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPEN2                           BANKMASK(SSP2CON1), 5
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM02                           BANKMASK(SSP2CON1), 0
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM12                           BANKMASK(SSP2CON1), 1
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM22                           BANKMASK(SSP2CON1), 2
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPM32                           BANKMASK(SSP2CON1), 3
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define SSPOV2                           BANKMASK(SSP2CON1), 6
#define START1                           BANKMASK(SSP1STAT), 3
#define START2                           BANKMASK(SSP2STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
#define STATE                            BANKMASK(WDTTMR), 2
#define STATUS_SHAD0                     BANKMASK(STATUS_SHAD), 0
#define STATUS_SHAD1                     BANKMASK(STATUS_SHAD), 1
#define STATUS_SHAD2                     BANKMASK(STATUS_SHAD), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKPTR0                          BANKMASK(STKPTR), 0
#define STKPTR1                          BANKMASK(STKPTR), 1
#define STKPTR2                          BANKMASK(STKPTR), 2
#define STKPTR3                          BANKMASK(STKPTR), 3
#define STKPTR4                          BANKMASK(STKPTR), 4
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STOP2                            BANKMASK(SSP2STAT), 4
#define STPT0                            BANKMASK(ADSTPTL), 0
#define STPT1                            BANKMASK(ADSTPTL), 1
#define STPT10                           BANKMASK(ADSTPTH), 2
#define STPT11                           BANKMASK(ADSTPTH), 3
#define STPT12                           BANKMASK(ADSTPTH), 4
#define STPT13                           BANKMASK(ADSTPTH), 5
#define STPT15                           BANKMASK(ADSTPTH), 6
#define STPT16                           BANKMASK(ADSTPTH), 7
#define STPT2                            BANKMASK(ADSTPTL), 2
#define STPT3                            BANKMASK(ADSTPTL), 3
#define STPT4                            BANKMASK(ADSTPTL), 4
#define STPT5                            BANKMASK(ADSTPTL), 5
#define STPT6                            BANKMASK(ADSTPTL), 6
#define STPT7                            BANKMASK(ADSTPTL), 7
#define STPT8                            BANKMASK(ADSTPTH), 0
#define STPT9                            BANKMASK(ADSTPTH), 1
#define STRA                             BANKMASK(CWG1STR), 0
#define STRB                             BANKMASK(CWG1STR), 1
#define STRC                             BANKMASK(CWG1STR), 2
#define STRD                             BANKMASK(CWG1STR), 3
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 3
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKIPPS5                        BANKMASK(T0CKIPPS), 5
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0MD16                           BANKMASK(T0CON0), 4
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0OUTPS0                         BANKMASK(T0CON0), 0
#define T0OUTPS1                         BANKMASK(T0CON0), 1
#define T0OUTPS2                         BANKMASK(T0CON0), 2
#define T0OUTPS3                         BANKMASK(T0CON0), 3
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKIPPS5                        BANKMASK(T1CKIPPS), 5
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1CS4                            BANKMASK(T1CLK), 4
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GPPS5                          BANKMASK(T1GPPS), 5
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
#define T1GSS3                           BANKMASK(T1GATE), 3
#define T1GSS4                           BANKMASK(T1GATE), 4
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1RD16                           BANKMASK(T1CON), 1
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CPOL                           BANKMASK(T2HLT), 6
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2CSYNC                          BANKMASK(T2HLT), 5
#define T2INPPS0                         BANKMASK(T2INPPS), 0
#define T2INPPS1                         BANKMASK(T2INPPS), 1
#define T2INPPS2                         BANKMASK(T2INPPS), 2
#define T2INPPS3                         BANKMASK(T2INPPS), 3
#define T2INPPS4                         BANKMASK(T2INPPS), 4
#define T2INPPS5                         BANKMASK(T2INPPS), 5
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T2RSEL4                          BANKMASK(T2RST), 4
#define T3CKPS0                          BANKMASK(T3CON), 4
#define T3CKPS1                          BANKMASK(T3CON), 5
#define T3CS0                            BANKMASK(T3CLK), 0
#define T3CS1                            BANKMASK(T3CLK), 1
#define T3CS2                            BANKMASK(T3CLK), 2
#define T3CS3                            BANKMASK(T3CLK), 3
#define T3CS4                            BANKMASK(T3CLK), 4
#define T3GE                             BANKMASK(T3GCON), 7
#define T3GGO                            BANKMASK(T3GCON), 3
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3
#define T3GPOL                           BANKMASK(T3GCON), 6
#define T3GSPM                           BANKMASK(T3GCON), 4
#define T3GSS0                           BANKMASK(T3GATE), 0
#define T3GSS1                           BANKMASK(T3GATE), 1
#define T3GSS2                           BANKMASK(T3GATE), 2
#define T3GSS3                           BANKMASK(T3GATE), 3
#define T3GSS4                           BANKMASK(T3GATE), 4
#define T3GTM                            BANKMASK(T3GCON), 5
#define T3GVAL                           BANKMASK(T3GCON), 2
#define T3RD16                           BANKMASK(T3CON), 1
#define T4CKPS0                          BANKMASK(T4CON), 4
#define T4CKPS1                          BANKMASK(T4CON), 5
#define T4CKPS2                          BANKMASK(T4CON), 6
#define T4CPOL                           BANKMASK(T4HLT), 6
#define T4CS0                            BANKMASK(T4CLKCON), 0
#define T4CS1                            BANKMASK(T4CLKCON), 1
#define T4CS2                            BANKMASK(T4CLKCON), 2
#define T4CS3                            BANKMASK(T4CLKCON), 3
#define T4CSYNC                          BANKMASK(T4HLT), 5
#define T4MODE0                          BANKMASK(T4HLT), 0
#define T4MODE1                          BANKMASK(T4HLT), 1
#define T4MODE2                          BANKMASK(T4HLT), 2
#define T4MODE3                          BANKMASK(T4HLT), 3
#define T4MODE4                          BANKMASK(T4HLT), 4
#define T4ON                             BANKMASK(T4CON), 7
#define T4OUTPS0                         BANKMASK(T4CON), 0
#define T4OUTPS1                         BANKMASK(T4CON), 1
#define T4OUTPS2                         BANKMASK(T4CON), 2
#define T4OUTPS3                         BANKMASK(T4CON), 3
#define T4PSYNC                          BANKMASK(T4HLT), 7
#define T4RSEL0                          BANKMASK(T4RST), 0
#define T4RSEL1                          BANKMASK(T4RST), 1
#define T4RSEL2                          BANKMASK(T4RST), 2
#define T4RSEL3                          BANKMASK(T4RST), 3
#define T4RSEL4                          BANKMASK(T4RST), 4
#define T6CKPS0                          BANKMASK(T6CON), 4
#define T6CKPS1                          BANKMASK(T6CON), 5
#define T6CKPS2                          BANKMASK(T6CON), 6
#define T6CPOL                           BANKMASK(T6HLT), 6
#define T6CS0                            BANKMASK(T6CLKCON), 0
#define T6CS1                            BANKMASK(T6CLKCON), 1
#define T6CS2                            BANKMASK(T6CLKCON), 2
#define T6CS3                            BANKMASK(T6CLKCON), 3
#define T6CSYNC                          BANKMASK(T6HLT), 5
#define T6MODE0                          BANKMASK(T6HLT), 0
#define T6MODE1                          BANKMASK(T6HLT), 1
#define T6MODE2                          BANKMASK(T6HLT), 2
#define T6MODE3                          BANKMASK(T6HLT), 3
#define T6MODE4                          BANKMASK(T6HLT), 4
#define T6ON                             BANKMASK(T6CON), 7
#define T6OUTPS0                         BANKMASK(T6CON), 0
#define T6OUTPS1                         BANKMASK(T6CON), 1
#define T6OUTPS2                         BANKMASK(T6CON), 2
#define T6OUTPS3                         BANKMASK(T6CON), 3
#define T6PSYNC                          BANKMASK(T6HLT), 7
#define T6RSEL0                          BANKMASK(T6RST), 0
#define T6RSEL1                          BANKMASK(T6RST), 1
#define T6RSEL2                          BANKMASK(T6RST), 2
#define T6RSEL3                          BANKMASK(T6RST), 3
#define T6RSEL4                          BANKMASK(T6RST), 4
#define TMD0                             BANKMASK(ADCON3), 0
#define TMD1                             BANKMASK(ADCON3), 1
#define TMD2                             BANKMASK(ADCON3), 2
#define TMR0H0                           BANKMASK(TMR0H), 0
#define TMR0H1                           BANKMASK(TMR0H), 1
#define TMR0H2                           BANKMASK(TMR0H), 2
#define TMR0H3                           BANKMASK(TMR0H), 3
#define TMR0H4                           BANKMASK(TMR0H), 4
#define TMR0H5                           BANKMASK(TMR0H), 5
#define TMR0H6                           BANKMASK(TMR0H), 6
#define TMR0H7                           BANKMASK(TMR0H), 7
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0L0                           BANKMASK(TMR0L), 0
#define TMR0L1                           BANKMASK(TMR0L), 1
#define TMR0L2                           BANKMASK(TMR0L), 2
#define TMR0L3                           BANKMASK(TMR0L), 3
#define TMR0L4                           BANKMASK(TMR0L), 4
#define TMR0L5                           BANKMASK(TMR0L), 5
#define TMR0L6                           BANKMASK(TMR0L), 6
#define TMR0L7                           BANKMASK(TMR0L), 7
#define TMR0MD                           BANKMASK(PMD0), 7
#define TMR10                            BANKMASK(TMR1L), 0
#define TMR11                            BANKMASK(TMR1L), 1
#define TMR110                           BANKMASK(TMR1H), 2
#define TMR111                           BANKMASK(TMR1H), 3
